app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (actor LIKE '%%')
---
  def index
    @movies = Movie.search(params[:search])

INSERT INTO "movies" ("description", "year", "director", "film_location", "country", "created_at", "updated_at", "actor") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_movie
      @movie = Movie.find(params[:id])